jonasgeremias/STM32_Ummi_Contador_de_pecas/Core/Inc/timer.h
/*
 * timer.h
 *
 *  Created on: Apr 1, 2026
 *      Author: Lucas
 */

#ifndef INC_TIMER_H_
#define INC_TIMER_H_


#include "stm32f4xx_hal.h"
#include <stdbool.h>
#include <stdint.h>


extern volatile uint16_t timer_3ms;
extern volatile uint16_t timer_5ms;
extern volatile uint16_t timer_10ms;
extern volatile uint16_t timer_50ms;
extern volatile uint16_t timer_100ms;
extern volatile uint16_t timer_500ms;
extern volatile uint16_t timer_1000ms;

extern volatile uint8_t timer_flag_3ms;
extern volatile uint8_t timer_flag_5ms;
extern volatile uint8_t timer_flag_10ms;
extern volatile uint8_t timer_flag_50ms;
extern volatile uint8_t timer_flag_100ms;
extern volatile uint8_t timer_flag_500ms;
extern volatile uint8_t timer_flag_1000ms;
extern volatile uint8_t timer_cnt_1000ms;

extern volatile uint16_t btn_max_timeout;
extern volatile uint16_t btn_min_timeout;


void mainIsr(void);
void tmr_3ms(void);
void tmr_5ms(void);
void tmr_10ms(void);
void tmr_50ms(void);
void tmr_100ms(void);
void tmr_500ms(void);
void tmr_1000ms(void);

void display_scan(void);
// void debounce_btns(void);
// void debounce_entradas_digitais(void);
// void serialHandleTimeout1ms(void);

#endif /* INC_TIMER_H_ */
